___


<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>

___

## Creating a Pandas Series

In [11]:
import numpy as np
import pandas as pd

### Creating a Pandas Series with Basic Format

In [12]:
ser=pd.Series([5,10,15,20,25])

In [13]:
ser

0     5
1    10
2    15
3    20
4    25
dtype: int64

### Basic Attributes of Series

In [14]:
type(ser)

pandas.core.series.Series

In [15]:
ser.dtype

dtype('int64')

In [16]:
ser.size

5

In [17]:
ser.ndim

1

In [18]:
ser.values

array([ 5, 10, 15, 20, 25], dtype=int64)

In [19]:
ser.head(3)

0     5
1    10
2    15
dtype: int64

In [20]:
ser.tail(2)

3    20
4    25
dtype: int64

### Creating Pandas Series by Using a ``list``, numpy array or ``dict``ionary

In [57]:
labels = [i for i in 'python']
my_list = list(np.arange(6))
d = dict(zip(labels,my_list))

arr = np.array([10, 20, 30,40,50,60])

### **Using Lists**

In [58]:
pd.Series(labels)

0    p
1    y
2    t
3    h
4    o
5    n
dtype: object

### **Using NumPy Arrays**

In [59]:
pd.Series(data = arr, index = labels)

p    10
y    20
t    30
h    40
o    50
n    60
dtype: int32

### **Using Dictionary**

In [61]:
pd.Series(d)

p    0
y    1
t    2
h    3
o    4
n    5
dtype: int64

In [65]:
pd.Series(data = d, index= ['q', 'o', 'y','t','k','p'])

q    NaN
o    4.0
y    1.0
t    2.0
k    NaN
p    0.0
dtype: float64

### Data in a Series

A pandas Series can hold a variety of object types:

In [72]:
pd.Series({1,2,3,6})

TypeError: 'set' type is unordered

In [68]:
pd.Series(set)

0    <class 'set'>
dtype: object

In [76]:
pd.Series(['pandas', 5, False, np.mean, len])

0                                   pandas
1                                        5
2                                    False
3    <function mean at 0x000002F716EC05E0>
4                  <built-in function len>
dtype: object

***

## Indexing Pandas Series

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look up of information.

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [77]:
ser1 = pd.Series([1,2,3,4,5],index = ['numpy', 'pandas','sql', 'gss','scipy'])

In [78]:
ser2 = pd.Series([1,2,5,4,6],index = ['numpy', 'pandas','tableau', 'seaborn','matplotlib'])

In [79]:
ser1

numpy     1
pandas    2
sql       3
gss       4
scipy     5
dtype: int64

In [80]:
ser2

numpy         1
pandas        2
tableau       5
seaborn       4
matplotlib    6
dtype: int64

In [83]:
ser1['numpy']

1

In [84]:
ser2['tableau']

5

Operations are then also done based off of index:

In [85]:
ser1 + ser2

gss           NaN
matplotlib    NaN
numpy         2.0
pandas        4.0
scipy         NaN
seaborn       NaN
sql           NaN
tableau       NaN
dtype: float64

### Indexing Examples

In [91]:
np.random.seed(101)
a = np.array(np.random.randint(5,12,6))
panser = pd.Series(a)
panser

0     8
1     6
2    11
3    10
4     8
5     6
dtype: int32

In [92]:
panser[0:2]

0    8
1    6
dtype: int32

### pandas_series[index] | pandas_series[[indices, indices...]]

In [93]:
panser = pd.Series(data = [25, 32, 35, 33], index = ["terry", "micheal", "orion", "jason"])
panser

terry      25
micheal    32
orion      35
jason      33
dtype: int64

In [98]:
panser[2]

35

In [99]:
index1 = ['terry', 'micheal', 'jason']

In [101]:
panser[index1]

terry      25
micheal    32
jason      33
dtype: int64

In [102]:
panser['terry':'orion']

terry      25
micheal    32
orion      35
dtype: int64

In [49]:
panser[0:3]

terry      121
micheal    200
orion      150
dtype: int64

### Several Selecting Attributes

In [103]:
panser.keys()

Index(['terry', 'micheal', 'orion', 'jason'], dtype='object')

In [104]:
panser.index

Index(['terry', 'micheal', 'orion', 'jason'], dtype='object')

In [105]:
panser.values

array([25, 32, 35, 33], dtype=int64)

In [106]:
panser.items()

In [107]:
list(panser.items())

[('terry', 25), ('micheal', 32), ('orion', 35), ('jason', 33)]

In [109]:
'jackson' in panser

False

In [110]:
25 in panser.values

True

In [111]:
panser['terry'] = 99

In [112]:
panser

terry      99
micheal    32
orion      35
jason      33
dtype: int64

In [113]:
panser[panser > 32]

terry    99
orion    35
jason    33
dtype: int64

DataFrames

In [116]:
data = np.arange(1,21,4)

In [117]:
pd.DataFrame(data, columns=['column1'])

   column1
0        1
1        5
2        9
3       13
4       17

In [126]:
data2 = np.arange(1,18,2).reshape(3,3)

In [127]:
df3=pd.DataFrame(data2, columns=['var1', 'var2', 'var3'])
df3

   var1  var2  var3
0     1     3     5
1     7     9    11
2    13    15    17

In [129]:
df3.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [130]:
df3.columns = ['new1', 'new2','new3']

In [131]:
df3

   new1  new2  new3
0     1     3     5
1     7     9    11
2    13    15    17

for your info:

* 1 dim --> vector 
* 2 dim --> matrix
* 3 dim --> tensor

 - ### Creating a DataFrame using a ``NumPy Arrays``

In [136]:
m=np.arange(1,50,5).reshape(5,2)
m

array([[ 1,  6],
       [11, 16],
       [21, 26],
       [31, 36],
       [41, 46]])

In [140]:
df=pd.DataFrame(m, columns=['col1','col2'])
df

   col1  col2
0     1     6
1    11    16
2    21    26
3    31    36
4    41    46

In [141]:
df.sample(2)

   col1  col2
2    21    26
1    11    16

 - ### Creating a DataFrame using a ``dict``

In [152]:
np.random.seed(101)
s1 = np.random.randint(10,18, size = 4)
s2 = np.random.randint(19,27, size = 4)
s3 = np.random.randint(28,35, size = 4)

In [153]:
myDict= {'var1':s1,'var2':s2,'var3':s3}

In [154]:
df1 = pd.DataFrame(myDict)

In [155]:
df1

   var1  var2  var3
0    17    26    29
1    13    26    33
2    11    24    28
3    16    22    32

- Simple indexing and slicing the ``DataFrames``

In [158]:
df1[1:3]

   var1  var2  var3
1    13    26    33
2    11    24    28

In [159]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [160]:
df1.index = ["a", "b", "c", "d"]

In [161]:
df1

   var1  var2  var3
a    17    26    29
b    13    26    33
c    11    24    28
d    16    22    32

In [162]:
df1['b':'d']

   var1  var2  var3
b    13    26    33
c    11    24    28
d    16    22    32

In [163]:
# we can check any column name whether it belongs to the DataFrame or not
"var2" in df1

True

In [164]:
'var5' in df1

False

### Now, let's examine again the ***idexing, selection*** and ***slicing*** methods and several ***attributes*** using a different DataFrame

In [165]:
from numpy.random import randn
np.random.seed(101)

In [170]:
# creating a DataFrame by "keyword arguments"
df3=pd.DataFrame(randn(5,4),columns='w x y z'.split(), index='a b c d e'.split())
df3

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [172]:
df3['y']

a   -0.376519
b   -0.031160
c    0.187125
d    0.961458
e   -1.046780
Name: y, dtype: float64

#### DataFrame Columns are just Series

In [173]:
df3[['y']]

          y
a -0.376519
b -0.031160
c  0.187125
d  0.961458
e -1.046780

In [174]:
# Pass a list of column names
df3[['w','y']]

          w         y
a  0.386030 -0.376519
b  0.681209 -0.031160
c -1.005187  0.187125
d -1.382920  0.961458
e  0.992573 -1.046780

In [175]:
df3

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [176]:
df3['c':'e']

          w         x         y         z
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

**Creating a new column:**

In [177]:
df3['w+z']=df3['w']*df3['z']
df3

          w         x         y         z       w+z
a  0.386030  2.084019 -0.376519  0.230336  0.088917
b  0.681209  1.035125 -0.031160  1.939932  1.321500
c -1.005187 -0.741790  0.187125 -0.732845  0.736646
d -1.382920  1.482495  0.961458 -2.141212  2.961126
e  0.992573  1.192241 -1.046780  1.292765  1.283164

 - ### Removing Columns

In [179]:
# Not inplace unless specified!
df3.drop('w+z', axis=1, inplace=True)

In [180]:
df3

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

 - ### Removing rows

In [181]:
# the default value of axis is 0 (axis = 0)
df4=df3.drop('c',axis=0)

In [182]:
df4

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

### Selecting Rows

- ### First, let's take a quick look at [`.loc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-loc.ipynb) | [`.iloc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-iloc.ipynb)

#### `.loc[]`  allows us to select data using **labels** (names) of rows (index) & columns

#### `.iloc[]`  allows us to select data using **index numbers** of rows (index) & columns. it's like classical indexing logic

In [200]:
np.random.seed(101)
m=np.random.randint(1,20, size=(5,4))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4

   var1  var2  var3  var4
0    12    18     7    12
1    16    10    14     9
2     5     9     1    15
3     6    13     9    18
4    16     9     3    13

In [201]:
df4.loc[4]

var1    16
var2     9
var3     3
var4    13
Name: 4, dtype: int32

In [203]:
# Slicing produces the same type of the data. Here, DataFrame
df4.loc[2:4]

   var1  var2  var3  var4
2     5     9     1    15
3     6    13     9    18
4    16     9     3    13

In [204]:
df4.iloc[2:4]

   var1  var2  var3  var4
2     5     9     1    15
3     6    13     9    18

In [208]:
df4.index='a b c d e'.split()
df4

   var1  var2  var3  var4
a    12    18     7    12
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18
e    16     9     3    13

In [209]:
df4.iloc[1:4]

   var1  var2  var3  var4
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18

In [210]:
df4.loc['b':'e']

   var1  var2  var3  var4
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18
e    16     9     3    13

In [211]:
df4

   var1  var2  var3  var4
a    12    18     7    12
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18
e    16     9     3    13

In [214]:
df4.loc['b':'e','var3']

b    14
c     1
d     9
e     3
Name: var3, dtype: int32

In [215]:
# how can we select these data as a DataFrame not a series
df4.loc['b':'d'][['var2']]

   var2
b    10
c     9
d    13

In [216]:
df4.iloc[2:5,2]

c    1
d    9
e    3
Name: var3, dtype: int32

In [218]:
df4.iloc[2:5][['var3']]

   var3
c     1
d     9
e     3

In [222]:
df3.loc['c']

w   -1.005187
x   -0.741790
y    0.187125
z   -0.732845
Name: c, dtype: float64

In [223]:
df3.loc[['c']]

          w        x         y         z
c -1.005187 -0.74179  0.187125 -0.732845

### Selecting subset of rows and columns

 - ### `.loc[[row labels|names], [column labels|names]]`

 - ### `.iloc[[row index numbers], [column index numbers]]`

In [224]:
df3

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [226]:
df3.loc['c','w']

-1.005186917256266

In [227]:
# let's select the same data as a DataFrame
df3.loc[['c'],['w']]

          w
c -1.005187

In [228]:
df3.loc[['c','e'],['w','z']]

          w         z
c -1.005187 -0.732845
e  0.992573  1.292765

In [229]:
df3.iloc[[0,2],[0,3]]

          w         z
a  0.386030  0.230336
c -1.005187 -0.732845

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [231]:
df3[df3>0.2]

          w         x         y         z
a  0.386030  2.084019       NaN  0.230336
b  0.681209  1.035125       NaN  1.939932
c       NaN       NaN       NaN       NaN
d       NaN  1.482495  0.961458       NaN
e  0.992573  1.192241       NaN  1.292765

In [232]:
# It returns based on rows.
df3[df3['y']<0.5]

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
e  0.992573  1.192241 -1.046780  1.292765

In [233]:
df3

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [235]:
df3[df3['w']<1][['z','y']]

          z         y
a  0.230336 -0.376519
b  1.939932 -0.031160
c -0.732845  0.187125
d -2.141212  0.961458
e  1.292765 -1.046780

#### For two conditions you can use **|**  `or`,  **&**   `and` with parenthesis:

In [236]:
df3

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [237]:
df3[(df3['w']>0) & (df3['z']<1)]

         w         x         y         z
a  0.38603  2.084019 -0.376519  0.230336

#### Conditional selection using ``.loc[]`` and ``.iloc[]``

In [238]:
df3

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [239]:
df3.loc[(df3.y>0), ['w','z']]

          w         z
c -1.005187 -0.732845
d -1.382920 -2.141212

In [240]:
df3.loc[((df3.x>1) | (df3.y<1)), ['x','w']]

          x         w
a  2.084019  0.386030
b  1.035125  0.681209
c -0.741790 -1.005187
d  1.482495 -1.382920
e  1.192241  0.992573

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [241]:
df3

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [242]:
# Reset to default 0,1...n index
df3.reset_index()

  index         w         x         y         z
0     a  0.386030  2.084019 -0.376519  0.230336
1     b  0.681209  1.035125 -0.031160  1.939932
2     c -1.005187 -0.741790  0.187125 -0.732845
3     d -1.382920  1.482495  0.961458 -2.141212
4     e  0.992573  1.192241 -1.046780  1.292765

In [243]:
df3.reset_index(drop=True)

          w         x         y         z
0  0.386030  2.084019 -0.376519  0.230336
1  0.681209  1.035125 -0.031160  1.939932
2 -1.005187 -0.741790  0.187125 -0.732845
3 -1.382920  1.482495  0.961458 -2.141212
4  0.992573  1.192241 -1.046780  1.292765

In [244]:
newindx='CA NY WY OR CO'.split()
newindx

['CA', 'NY', 'WY', 'OR', 'CO']

In [245]:
df3['newidx']=newindx

In [246]:
df3

          w         x         y         z newidx
a  0.386030  2.084019 -0.376519  0.230336     CA
b  0.681209  1.035125 -0.031160  1.939932     NY
c -1.005187 -0.741790  0.187125 -0.732845     WY
d -1.382920  1.482495  0.961458 -2.141212     OR
e  0.992573  1.192241 -1.046780  1.292765     CO

In [248]:
df3.set_index('newidx',inplace=True)

In [249]:
df3

               w         x         y         z
newidx
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [255]:
# Index Levels
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

In [256]:
hier_index=pd.MultiIndex.from_tuples(multi_index)

In [257]:
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [259]:
df5=pd.DataFrame(np.random.randn(9,4), index = hier_index, columns=['A','B','C','D'])
df5

             A         B         C         D
M1 1 -2.288978  0.441018  0.656973  0.136999
   2 -0.451982 -1.094163 -0.006354 -1.403832
   3 -0.202026 -1.089143  1.406601  1.577691
M2 1  0.545812 -0.693707 -0.389968 -0.170756
   2 -0.703198  2.067214  0.455452 -1.123753
   3 -1.088266 -0.609936 -0.635511 -0.728053
M3 5 -0.594951 -0.593371  0.911416 -1.768073
   6  0.205247  0.211945 -1.240039  1.049300
   7 -0.410414  0.340754  0.805027  0.528188

Now let's show how to index this! For index hierarchy we use ``df.loc[]``, if this was on the columns axis, you would just use normal bracket notation ``df[]``. Calling one level of the index returns the sub-dataframe:

In [273]:
df5.loc['M3']

            A         B         C         D
Num
5   -0.594951 -0.593371  0.911416 -1.768073
6    0.205247  0.211945 -1.240039  1.049300
7   -0.410414  0.340754  0.805027  0.528188

In [274]:
df5.loc['M2'].loc[2]

A   -0.703198
B    2.067214
C    0.455452
D   -1.123753
Name: 2, dtype: float64

In [275]:
df5.loc['M2'].loc[[2]]

            A         B         C         D
Num
2   -0.703198  2.067214  0.455452 -1.123753

In [262]:
df5.index.names

FrozenList([None, None])

In [263]:
df5.index.names = ['Group','Num']

In [264]:
df5

                  A         B         C         D
Group Num
M1    1   -2.288978  0.441018  0.656973  0.136999
      2   -0.451982 -1.094163 -0.006354 -1.403832
      3   -0.202026 -1.089143  1.406601  1.577691
M2    1    0.545812 -0.693707 -0.389968 -0.170756
      2   -0.703198  2.067214  0.455452 -1.123753
      3   -1.088266 -0.609936 -0.635511 -0.728053
M3    5   -0.594951 -0.593371  0.911416 -1.768073
      6    0.205247  0.211945 -1.240039  1.049300
      7   -0.410414  0.340754  0.805027  0.528188

### let's take a quick look at the [``.xs()``](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-xs.ipynb)

In [276]:
df5.xs('M3')

            A         B         C         D
Num
5   -0.594951 -0.593371  0.911416 -1.768073
6    0.205247  0.211945 -1.240039  1.049300
7   -0.410414  0.340754  0.805027  0.528188

In [277]:
df5.loc['M3']

            A         B         C         D
Num
5   -0.594951 -0.593371  0.911416 -1.768073
6    0.205247  0.211945 -1.240039  1.049300
7   -0.410414  0.340754  0.805027  0.528188

In [267]:
df5

                  A         B         C         D
Group Num
M1    1   -2.288978  0.441018  0.656973  0.136999
      2   -0.451982 -1.094163 -0.006354 -1.403832
      3   -0.202026 -1.089143  1.406601  1.577691
M2    1    0.545812 -0.693707 -0.389968 -0.170756
      2   -0.703198  2.067214  0.455452 -1.123753
      3   -1.088266 -0.609936 -0.635511 -0.728053
M3    5   -0.594951 -0.593371  0.911416 -1.768073
      6    0.205247  0.211945 -1.240039  1.049300
      7   -0.410414  0.340754  0.805027  0.528188

In [278]:
df5.xs(['M2',2])

A   -0.703198
B    2.067214
C    0.455452
D   -1.123753
Name: (M2, 2), dtype: float64

In [279]:
df5.xs(3, level = 'Num')

              A         B         C         D
Group
M1    -0.202026 -1.089143  1.406601  1.577691
M2    -1.088266 -0.609936 -0.635511 -0.728053

In [271]:
df5.xs(3, level = 1)

              A         B         C         D
Group
M1    -0.202026 -1.089143  1.406601  1.577691
M2    -1.088266 -0.609936 -0.635511 -0.728053

In [272]:
df5.xs('A',axis=1)

Group  Num
M1     1     -2.288978
       2     -0.451982
       3     -0.202026
M2     1      0.545812
       2     -0.703198
       3     -1.088266
M3     5     -0.594951
       6      0.205247
       7     -0.410414
Name: A, dtype: float64